ERP/src/InformationRegisters/СтимулыПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтимулыПартнеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимула</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контракт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПартнерскийКонтракт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтимула</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСтимулаЗаРеферал</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/InformationRegisters/СтимулыПартнеров/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеСтимула(Партнер, Компания, ВидСтимула) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтимулыПартнеров.ЗначениеСтимула КАК ЗначениеСтимула
		|ИЗ
		|	РегистрСведений.СтимулыПартнеров КАК СтимулыПартнеров
		|ГДЕ
		|	СтимулыПартнеров.Партнер = &Партнер
		|	И СтимулыПартнеров.Компания = &Компания
		|	И СтимулыПартнеров.ВидСтимула = &ВидСтимула";
	
	Запрос.УстановитьПараметр("ВидСтимула", ВидСтимула);
	Запрос.УстановитьПараметр("Компания", Компания);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ЗначениеСтимула;
	
КонецФункции
